package main

import (
	"fmt"
	//"reflect"
)

/*
Дана последовательность температурных колебаний (-25.4, -27.0 13.0, 19.0,
15.5, 24.5, -21.0, 32.5). Объединить данный значения в группы с шагов в 10
градусов. Последовательность в подмножностве не важна.
Пример: (-20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc)
*/

func main() {
	temp := []float32{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5}

	set := make(map[int][]float32)

	for _, elem := range temp {
		key := int(elem) - int(elem)%10
		set[key] = append(set[key], elem)
	}

	fmt.Println(set)
}
